natConvBox/case_215/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          215;
        startFace       92020;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          215;
        startFace       92235;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          215;
        startFace       92450;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          215;
        startFace       92665;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          92450;
        startFace       92880;
    }
)

// ************************************************************************* //
